// Home Work 3

// не получается писать корректный код, могу читать код, 
// понимаю что происходит в коде, а самостоятельно не могу написать корректный, 
// посоветуйте Павел какой нибудь доп. материал чтоб прям полностью 
// начать правильно мыслить и разбираться.

/*
Задача 19 (НЕ ПОЛУЧАЕТСЯ РЕШИТЬ, СОБРАТЬСЯ С МЫСЛЯМИ И СОБРАТЬ ЕЕ В КУЧУ :(((   )
Напишите программу, которая принимает на вход пятизначное число и проверяет, 
является ли оно палиндромом.
    14212 -> нет
    12821 -> да
    23432 -> да
*/
 


/*
Задача 21
Напишите программу, которая принимает на вход координаты двух точек 
и находит расстояние между ними в 3D пространстве.
    A (3,6,8); B (2,1,-7), -> 15.84
    A (7,-5, 0); B (1,-1,9) -> 11.53
*/
/*
int x1 = Cord("Введите координаты 'X' для Первой точки ");
int y1 = Cord("Введите координаты 'Y' для Первой точки ");
int z1 = Cord("Введите координаты 'Z' для Первой точки ");
int x2 = Cord("Введите координаты 'X' для Второй точки ");
int y2 = Cord("Введите координаты 'Y' для Второй точки ");
int z2 = Cord("Введите координаты 'Z' для Второй точки ");

int A = x2 - x1;
int B = y2 - y1;
int C = z2 - z1;

double length = Math.Sqrt(A * A + B * B + C * C);
Console.WriteLine("Расстояние" + length);

int Cord(string massage)
{
    Console.Write(massage);
    return Convert.ToInt32(Console.ReadLine());
}
*/



/*
Задача 23
Напишите программу, которая принимает на вход число (N) 
и выдаёт таблицу кубов чисел от 1 до N.
    3 -> 1, 8, 27
    5 -> 1, 8, 27, 64, 125
*/
/*
Console.Write("Введите число N: ");
int n = Convert.ToInt32(Console.ReadLine());
Console.Write("Таблица кубов: \n");
for (int i = 1; i <= n; i++)
{
int cub = i*i*i;
Console.Write($"{cub}, ");
}
*/



